package FifthWeek;

public class 집중도와행동성공변화 extends 기타지속변화 implements Runnable {

	public void run() {

		while(true) {
			try {
				Thread.sleep(1000);
			} catch(InterruptedException e) {
				e.printStackTrace();
			}
			
			
			if(체력저하사망.체력저하엔딩==true || 산소공급장치고장사망.산소공급장치고장엔딩==true || 구조선도착.구조선도착엔딩==true) {break;} //전체 쓰레드멈춤
			
			엔지니어.수리성공확률= 생존자.기본성공확률+엔지니어.엔지니어수리고유확률;
			엔지니어.농사성공확률= 생존자.기본성공확률+엔지니어.엔지니어농사고유확률;
			농식물학자.수리성공확률= 생존자.기본성공확률+농식물학자.농식물학자수리고유확률;
			농식물학자.농사성공확률= 생존자.기본성공확률+농식물학자.농식물학자농사고유확률;
			
			if(생존자.집중도==100) {
				생존자.기본성공확률 =0.55;
			}
			if(생존자.집중도<100 && 생존자.집중도>=90) {
				생존자.기본성공확률 =0.50;
			}
			if(생존자.집중도<90 && 생존자.집중도>=80) {
				생존자.기본성공확률 =0.45;
			}
			if(생존자.집중도<80 && 생존자.집중도>=70) {
				생존자.기본성공확률 =0.40;
			}
			if(생존자.집중도<70 && 생존자.집중도>=60) {
				생존자.기본성공확률 =0.35;		
			}
			if(생존자.집중도<60 && 생존자.집중도>=50) {
				생존자.기본성공확률 =0.30;	
			}
			if(생존자.집중도<50 && 생존자.집중도>=40) {
				생존자.기본성공확률 =0.25;		
			}
			if(생존자.집중도<40 && 생존자.집중도>=30) {
				생존자.기본성공확률 =0.20;	
			}
			if(생존자.집중도<30 && 생존자.집중도>=20) {
				생존자.기본성공확률 =0.15;	
			}
			if(생존자.집중도<20 && 생존자.집중도>=10) {
				생존자.기본성공확률 =0.10;	
			}
			if(생존자.집중도<10 && 생존자.집중도>=0) {
				생존자.기본성공확률 =0;	
			}
			

		}
	}

}
