package FifthWeek;


import java.io.File;
import java.io.FileNotFoundException;
import java.util.Scanner;

import Practice.연습1;

public class 화성에서살아남기 {


	public static void main(String[] args) {
		Scanner Scan = new Scanner(System.in);
		생존자.초기상태선언();	
		int 선택;
		int 선택1;
		int 선택2;
		int 선택3;
		int 선택4;
		
		
		인트로 인트로 = new 인트로();
		Thread 인트로쓰레드 = new Thread(인트로);
		인트로쓰레드.start();
		배경음악 타이핑기= new 배경음악("타이핑기4.mp3",false); 타이핑기.start();

		try {
			Thread.sleep(12300);  //120초에한번
		} catch(InterruptedException e) {
			e.printStackTrace();
		} 
		
		타이핑기.close();
		배경음악 우주음악= new 배경음악("우주음악.mp3",true);
		우주음악.start();

		do { 
			System.out.println("============================================================================================================================================================================================");
			System.out.println( "\"화성에서 살아남기\" 게임을 시작하셨습니다. 생존자의 이름을 입력해주세요.");
			System.out.println( "한번 정하면 바꾸기 어려우니 신중히 선택해주시기 바랍니다.");
			System.out.println("============================================================================================================================================================================================");
			생존자 생존자이름설정 = new 생존자(); 생존자이름설정.이름 =  Scan.next();
			배경음악 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
			System.out.println( "이름을 \"" + 생존자이름설정.이름 +"\"으로 정하셨습니다. 이대로 진행하시겠습니까? 1.예 2.아니오");
			System.out.println("============================================================================================================================================================================================");

			선택 = Scan.nextInt();
			switch(선택) {
			case 1 :  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				System.out.println("게임은 진행합니다.");
				break;
			case 2 : 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				System.out.println("다시 돌아갑니다.");
				break;
			default : 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				System.out.println("1과 2이외의 숫자를 입력하셨습니다. 다시 입력해주십시오");
				break;
			}
		} while(선택 != 1);




		do {
			System.out.println("생존자의 직업을 선택해주세요 1.엔지니어 2. 농식물학자 (한번 직업선택후 직업을 바꾸기 어려우니 신중히 선택히 주시기 바랍니다.)");
			System.out.println("============================================================================================================================================================================================");
			선택 = Scan.nextInt();
			switch(선택) {
			case 0 : 	배경음악 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				try{
					File file = new File("화성에서살아남기.txt");
					Scanner sc = new Scanner(file);
					while (sc.hasNextLine()) {
						System.out.println(sc.nextLine());
					}
					sc.close();
				} catch (FileNotFoundException e) {
					e.printStackTrace();
				}	break;

			case 1 : 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 생존자.엔지니어진행 = true;
			System.out.println("직업이 엔지니어로 선택되었습니다. 엔지니어는 행동당 수리+2, 농사 3초당 감자성장확률 +2%의 특성을 가집니다. 자세한설명은 게임규칙참조");
			System.out.println("초기값으로 화성생태계의 혹독한 모래폭풍의 영향에따라 최초의 수리도 및 남은감자수, 남은 물등이 랜덤으로 설정되었습니다.");
			System.out.println("이외에도 직업기본농사성공확률 10% 직업기본수리성공확률이 20%로 설정되어있습니다. 만약 숙련된 엔지니어로 전직시에는 직업기본수리성공확률이30%로 적용됩니다. 자세한사항은 게임규칙을 참고");
			System.out.println("추가로, 포만감,체내수분이 일정이하로 감소하면 체력과 집중도가 급속도로 떨어집니다. 또한 집중도가 떨어지면 기본성공확률이 떨어지니 조심하시기바랍니다.");

			생존자 생존직업설정을엔지니어로 = new 생존자(); 생존직업설정을엔지니어로.직업명 = "엔지니어";
			break;

			case 2 :일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();  생존자.농식물학자진행 = true;
			System.out.println("직업이 농식물학자로 선택되었습니다. 농식물학자는 행동당 수리+1, 농사 3초당 감자성장확률 +4%의 특성을 가집니다.자세한설명은 게임규칙참조");
			System.out.println("초기값으로 화성생태계의 혹독한 모래폭풍의 영향에따라 최초의 수리도 및 농사도와 남은감자수, 남은 물등이 랜덤으로 설정되었습니다.");
			System.out.println("이외에도 직업기본수리성공확률 10% 직업기본농사성공확률이 20%로 설정되어있습니다. 만약 숙련된 농식물학자로 전직시에는 직업기본농사성공확률이 30%로 적용됩니다. 자세한사항은 게임규칙을 참고");
			System.out.println("추가로, 포만감,체내수분이 일정이하로 감소하면 체력과 집중도가 급속도로 떨어집니다. 또한 집중도가 떨어지면 기본성공확률이 떨어지니 조심하시기바랍니다.");
			생존자 생존직업설정을농식물학자로 = new 생존자(); 생존직업설정을농식물학자로.직업명 = "농식물학자";
			break;

			default :일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();  System.out.println("0과 1과 2이외의 숫자를 입력하셨습니다. 다시 입력해주십시오");
			break;
			}
		} while(선택 !=1 && 선택 !=2);
		
		
		집중도와행동성공변화 집중도와행동성공변화 = new 집중도와행동성공변화();
		Thread 집중도와행동성공변화쓰레드 = new Thread(집중도와행동성공변화);

		집중도와행동성공변화쓰레드.setPriority(5);

		집중도와행동성공변화쓰레드.start();
		//집중도 지속효과 쓰레드선언 +시작




		체력저하사망 체력저하사망엔딩조건시작 = new 체력저하사망();
		구조선도착 구조선도착엔딩조건시작 = new 구조선도착();
		구조선이오기까지 구조선도착엔딩조건보조시작 = new 구조선이오기까지();
		산소공급장치고장사망 산소공급장치고장사망엔딩조건시작 = new 산소공급장치고장사망();

		Thread 체력저하사망엔딩조건쓰레드 = new Thread(체력저하사망엔딩조건시작);
		Thread 구조선도착엔딩조건쓰레드 = new Thread(구조선도착엔딩조건시작);
		Thread 구조선도착엔딩조건보조쓰레드 = new Thread(구조선도착엔딩조건보조시작);
		Thread 산소공급장치고장사망엔딩조건쓰레드 = new Thread(산소공급장치고장사망엔딩조건시작);

		체력저하사망엔딩조건쓰레드.setPriority(10);
		구조선도착엔딩조건쓰레드.setPriority(10);
		산소공급장치고장사망엔딩조건쓰레드.setPriority(10);

		체력저하사망엔딩조건쓰레드.start();
		구조선도착엔딩조건쓰레드.start();
		산소공급장치고장사망엔딩조건쓰레드.start();
		구조선도착엔딩조건보조쓰레드.start();
		//여기까지 엔딩조건 쓰레드선언 +시작(엔딩조건이 하나라도 완료되면 자동으로 시간 쓰레드 종료)


		생명유지할때지속변화 생명유지할때변화 = new 생명유지할때지속변화(); 
		생명유지할때특수변화 생명유지할때특수변화 = new 생명유지할때특수변화(); 
		Thread 생명유지할때변화쓰레드 = new Thread(생명유지할때변화);
		Thread 생명유지할때특수변화쓰레드 = new Thread(생명유지할때특수변화);

		생명유지할때변화쓰레드.setPriority(5);
		생명유지할때특수변화쓰레드.setPriority(5);

		생명유지할때변화쓰레드.start();
		생명유지할때특수변화쓰레드.start();

		//생명지속쓰레드선언 + 시작 (엔딩조건완료되면 두 쓰레드 모두 자동종료, 특정조건 만족하면 생명유지할때특수변화쓰레드의 체력,집중도감소효과 발동안함 이것또한 엔딩조건만족되면 종료)

		시간 시간 = new 시간(); 
		Thread 시간쓰레드 = new Thread(시간);
		시간쓰레드.start();
		//시간지속 쓰레드선언 + 시작(엔딩조건이 하나라도 완료되면 자동으로 시간 쓰레드 종료)


		통신기기변화 통신기기변화 = new 통신기기변화();
		산소공급장치변화 산소공급장치변화 = new 산소공급장치변화();	


		Thread 통신기기변화쓰레드 = new Thread(통신기기변화);
		Thread 산소공급장치변화쓰레드 = new Thread(산소공급장치변화);

		통신기기변화쓰레드.setPriority(5);
		산소공급장치변화쓰레드.setPriority(5);

		통신기기변화쓰레드.start();
		산소공급장치변화쓰레드.start();
		//기계 지속효과 쓰레드선언 + 시작

	

		감자자랄때변화 감자자랄때변화 = new 감자자랄때변화();
		Thread 감자자랄때변화쓰레드 = new Thread(감자자랄때변화);
		감자자랄때변화쓰레드.start();
		//감자자랄때 변화 지속쓰레드 선언 +시작(엔딩조건이 하나라도 완료되면 자동으로 시간 쓰레드 종료)

		농식물학자가통신기기수리할때변화 농식물학자가통신기기수리할때변화 = new 농식물학자가통신기기수리할때변화();
		농식물학자가산소공급장치수리할때변화 농식물학자가산소공급장치수리할때변화 = new 농식물학자가산소공급장치수리할때변화();
		엔지니어가산소공급장치수리할때변화 엔지니어가산소공급장치수리할때변화 = new 엔지니어가산소공급장치수리할때변화();
		엔지니어가통신기기수리할때변화 엔지니어가통신기기수리할때변화 = new 엔지니어가통신기기수리할때변화();


		농식물학자감자심기 농식물학자감자심기 = new 농식물학자감자심기();
		농식물학자거름주기 농식물학자거름주기 = new 농식물학자거름주기();
		농식물학자수확하기 농식물학자수확하기 = new 농식물학자수확하기();

		엔지니어감자심기 엔지니어감자심기 = new 엔지니어감자심기();
		엔지니어거름주기 엔지니어거름주기 = new 엔지니어거름주기();
		엔지니어수확하기 엔지니어수확하기 = new 엔지니어수확하기();


		//수리 및 농사 
		감자먹을때변화 감자먹을때변화 = new 감자먹을때변화();
		물마실때변화 물마실때변화 = new 물마실때변화();
		//먹고마시기
		쉴때변화 쉴때변화 = new 쉴때변화();
		잠잘때숙면도변화 잠잘때숙면도변화 = new 잠잘때숙면도변화();
		잠잘때수치변화 잠잘때수치변화 = new 잠잘때수치변화();
		잠자고숙면도집중도변화 잠자고숙면도집중도변화 = new 잠자고숙면도집중도변화();
		//쉬거나잠자기

		//여기까지 행동후 나타나는 쓰레드시작


		주지구화성개척본부 	주지구화성개척본부 = new 	주지구화성개척본부();
		Thread 지구와의통신 = new Thread(주지구화성개척본부);
		지구와의통신.start();

		화성의외계공동체 화성의외계공동체 = new 화성의외계공동체();
		Thread 외계와의통신 = new Thread(화성의외계공동체);
		외계와의통신.start();













		//여기까지 이벤트 쓰레드
		if(생존자.엔지니어진행) {
			do {

				System.out.println("============================================================================================================================================================================================");
				System.out.println("                                                           <메인화면> 0.일시정지 1.수리 2.농사 3.먹고마시기 4.쉬거나잠자기 5.통신");
				System.out.println("============================================================================================================================================================================================");

				선택 = Scan.nextInt(); 
				switch(선택) {
				case 0: 시간.일시정지=true; 생존자.현재상태인쇄(); 
				배경음악 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();

				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------일시정지를 선택하셨습니다.-----------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                 <일시정지> 1.현재상태 2.게임규칙 3.뒤로가기(게임재개)");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 2:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("------------------------------------------------------------------------------게임규칙인쇄를 선택하셨습니다.--------------------------------------------------------------------------------");
					System.out.println("============================================================================================================================================================================================");

					try{
						File file = new File("화성에서살아남기.txt");
						Scanner sc = new Scanner(file);
						while (sc.hasNextLine()) {
							System.out.println(sc.nextLine());
						}
						sc.close();
					} catch (FileNotFoundException e) {
						e.printStackTrace();
					}
					break;
					case 1: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("현재상태인쇄를 선택하셨습니다.");
					생존자.현재상태인쇄();
					break;
					case 3: 시간.일시정지=false; 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();



					Thread 시간쓰레드1 = new Thread(시간);
					Thread 생명유지할때변화쓰레드1 = new Thread(생명유지할때변화);
					Thread 생명유지할때특수변화쓰레드1 = new Thread(생명유지할때특수변화);
					Thread 통신기기변화쓰레드1 = new Thread(통신기기변화);
					Thread 산소공급장치변화쓰레드1 = new Thread(산소공급장치변화);
					Thread 감자자랄때변화쓰레드1 = new Thread(감자자랄때변화);
					Thread 지구와의통신1 = new Thread(주지구화성개척본부);
					Thread 외계와의통신1 = new Thread(화성의외계공동체);
					Thread 구조선도착엔딩조건보조쓰레드1 = new Thread(구조선도착엔딩조건보조시작);

					시간쓰레드1.start();
					생명유지할때변화쓰레드1.start();
					생명유지할때특수변화쓰레드1.start();
					통신기기변화쓰레드1.start();
					산소공급장치변화쓰레드1.start();
					감자자랄때변화쓰레드1.start();
					지구와의통신1.start();
					외계와의통신1.start();
					구조선도착엔딩조건보조쓰레드1.start();


					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.------------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;
				case 1: 	일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				배경음악 수리= new 배경음악("수리.mp3",true); 수리.start();
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------수리를 선택하셨습니다.---------------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                  <수리> 1.산소공급장치수리 2.통신기기수리 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt();
					switch(선택1) {
					case 1:  
						배경음악 수리기본효과음= new 배경음악("수리1.mp3",false); 수리기본효과음.start(); 배경음악 산소공급장치수리기본효과음= new 배경음악("수리2산소.mp3",false); 산소공급장치수리기본효과음.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------------산소공급장치수리를 선택하셨습니다.----------------------------------------------------------------------------");
						Thread  엔지니어가산소공급장치수리할때변화쓰레드 = new Thread(엔지니어가산소공급장치수리할때변화); 엔지니어가산소공급장치수리할때변화쓰레드.start();
						break;
					case 2:  
						배경음악 수리기본효과음1 = new 배경음악("수리1.mp3",false); 수리기본효과음1.start(); 배경음악 통신기기수리기본효과음= new 배경음악("수리2통신.mp3",false); 통신기기수리기본효과음.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------------통신기기수리를 선택하셨습니다.--------------------------------------------------------------------------------");
						Thread 엔지니어가통신기기수리할때변화쓰레드 = new Thread(엔지니어가통신기기수리할때변화); 엔지니어가통신기기수리할때변화쓰레드.start();
						break;
					case 3: 수리.close(); 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
					break;

					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;
				case 2: 	일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				배경음악 농사= new 배경음악("농사.mp3",true); 농사.start();
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------농사짓기를 선택하셨습니다.-----------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                  <농사> 0.감자수확하기 1.감자심기 2.물과 거름주기 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 0: 
						배경음악 수확하기= new 배경음악("수확하기.mp3",false); 수확하기.start();  

						생존자.현재상태인쇄();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-----------------------------------------------------------------------------감자수확하기를 선택하셨습니다.---------------------------------------------------------------------------------");
						Thread  엔지니어수확하기쓰레드 = new Thread(엔지니어수확하기); 엔지니어수확하기쓰레드.start();
						break;
					case 1: 
						배경음악 감자심기 = new 배경음악("감자심기.mp3",false); 감자심기.start();  
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------감자심기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						Thread  엔지니어감자심기쓰레드 = new Thread(엔지니어감자심기); 엔지니어감자심기쓰레드.start();
						break;
					case 2: 
						배경음악 물주기= new 배경음악("물주기.mp3",false); 물주기.start();  
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------물과거름주기를 선택하셨습니다.-------------------------------------------------------------------------------");
						Thread  엔지니어거름주기쓰레드 = new Thread(엔지니어거름주기); 엔지니어거름주기쓰레드.start();
						break;
					case 3: 농사.close();일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;
				case 3: 	일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();  
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------먹고마시기를 선택하셨습니다.---------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                       <먹고마시기> 1.감자먹기 2.물마시기 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 1: 
						배경음악 감자먹기= new 배경음악("감자먹기.mp3",false); 감자먹기.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("--------------------------------------------------------------------------------감자먹기를 선택하셨습니다.----------------------------------------------------------------------------------");
						Thread 감자먹을때변화쓰레드 = new Thread(감자먹을때변화); 감자먹을때변화쓰레드.start();
						break;
					case 2: 
						배경음악 물마시기= new 배경음악("물마시기.mp3",false); 물마시기.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("--------------------------------------------------------------------------------물마시기를 선택하셨습니다.----------------------------------------------------------------------------------");
						Thread 물마실때변화쓰레드 = new Thread(물마실때변화); 물마실때변화쓰레드.start();
						break;
					case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();   
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;

				case 4: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();  
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------휴식을 선택하셨습니다.---------------------------------------------------------------------------------------");

				do { 
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                      <휴식하기> 1.일반휴식 2.잠자기 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 1:  배경음악 일반휴식= new 배경음악("일반휴식.mp3",true); 일반휴식.start();  
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-----------------------------------------------------------------------------일반휴식을 선택하셨습니다.-------------------------------------------------------------------------------------");
					Thread 쉴때변화쓰레드 = new Thread(쉴때변화); 쉴때변화쓰레드.start();
					쉴때변화.쉬기끊기=false;
					do { System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                      <일반휴식> 1.현재상태보기 2.일반휴식그만두기");
					System.out.println("============================================================================================================================================================================================"); 
					선택2 = Scan.nextInt(); 
					switch(선택2) {
					case 1: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("---------------------------------------------------------------------------현재상태보기를 선택하셨습니다.-----------------------------------------------------------------------------------");
					System.out.println("============================================================================================================================================================================================");

					생존자.현재상태인쇄();
					break;
					case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					일반휴식.close();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("---------------------------------------------------------------------------일반휴식그만두기을 선택하셨습니다.-------------------------------------------------------------------------------");

					쉴때변화.쉬기끊기=true;
					break;
					}	
					}while(선택2 !=2 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
					break;
					case 2: 배경음악 잠자기= new 배경음악("잠자기.mp3",true); 잠자기.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("------------------------------------------------------------------------------잠자기를 선택하셨습니다.-------------------------------------------------------------------------------------");
					Thread 잠잘때숙면도변화쓰레드 = new Thread(잠잘때숙면도변화); 잠잘때숙면도변화쓰레드.start();
					Thread 잠잘때수치변화쓰레드 = new Thread(잠잘때수치변화); 잠잘때수치변화쓰레드.start();
					잠잘때혹은잠자고변화.잠자기끊기=false;
					do { 
						System.out.println("============================================================================================================================================================================================");
						System.out.println("                                                                      <잠자는중> 1.현재상태보기 2.잠그만자기");
						System.out.println("============================================================================================================================================================================================"); 
						선택2 = Scan.nextInt(); 
						switch(선택2) {
						case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("---------------------------------------------------------------------------현재상태보기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						System.out.println("============================================================================================================================================================================================");

						생존자.현재상태인쇄();
						break;
						case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 잠자기.close();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-----------------------------------------------------------------------------잠그만자기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						잠잘때혹은잠자고변화.잠자기끊기=true;
						Thread 잠자고숙면도집중도변화쓰레드 = new Thread(잠자고숙면도집중도변화); 잠자고숙면도집중도변화쓰레드.start();
						break;
						}	
					}while(선택2 !=2 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
					break;
					case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
				break;

				case 5: 배경음악 통신 = new 배경음악("통신.mp3",false); 통신.start();
				System.out.println("============================================================================================================================================================================================");
				System.out.println("---------------------------------------------------------------------------통신하기를 선택하셨습니다.---------------------------------------------------------------------------------------");
				do { 
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                               <통신하기> 1.지구와통신 2.외계신호탐지 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					if(생존자.통신기기수리활성화==false) { System.out.println("활성화하지 못했습니다. 통신기기를 완전히 수리해서 해당 영역을 활성화 할 수 있습니다.");
					break;
					}
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------지구와통신하기를 선택하셨습니다.-----------------------------------------------------------------------------------");
					do { 
						System.out.println("============================================================================================================================================================================================");
						System.out.println("                                                      <지구와통신하기> 1.지구에서신호받기 2.지구로신호주기 3.뒤로가기");
						System.out.println("============================================================================================================================================================================================");
						선택2 = Scan.nextInt(); 
						switch(선택2) {
						case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------지구에서신호받기를 선택하셨습니다.---------------------------------------------------------------------------------");
						System.out.println(주지구화성개척본부.메시지저장);
						break;
						case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------지구로신호주기를 선택하셨습니다.----------------------------------------------------------------------------------");
						do { 
							System.out.println("============================================================================================================================================================================================");
							System.out.println("                                                     <지구로신호주기> 1.현재상태보내기 2.외계신호전달하기 3.뒤로가기");
							System.out.println("============================================================================================================================================================================================");
							선택3 = Scan.nextInt(); 
							switch(선택3) {
							case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------현재상태보내기를 선택하셨습니다.---------------------------------------------------------------------------------");
							System.out.println("현재 먹을것과 물이 떨어져 상태가 안좋습니다. 화성 구조선이 좀더 빨리 도착했으면 좋겠습니다.");
							if(Math.random()<0.01) {
								난이도및랜덤.구조선이헤맬확률 -= 0.01;
								if(난이도및랜덤.구조선이헤맬확률<0) {
									난이도및랜덤.구조선이헤맬확률=0;
								}
								System.out.println("구조선이 일찍 도착할확률 증가!");
							}
							break;
							case 2:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							if(화성의외계공동체.외계와의통신==false) { System.out.println("활성화하지 못했습니다. 지구와의 통신을 통해서 해당 영역을 활성화 할 수 있습니다.");
							break;}
							System.out.println("============================================================================================================================================================================================");
							System.out.println("------------------------------------------------------------------------외계신호전달하기를 선택하셨습니다.----------------------------------------------------------------------------------");
							do { 
								System.out.println("============================================================================================================================================================================================");
								System.out.println("                                                     <외계신호전달하기> 외계에서 탐지한 신호를 입력해 주시기 바랍니다. 3.뒤로가기");
								System.out.println("============================================================================================================================================================================================");
								선택4 = Scan.nextInt(); 
								switch(선택4) {
								case 353447: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 주지구화성개척본부.지구로외계신호송출1=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달1을  완료하셨습니다.----------------------------------------------------------------------------------");
								break;
								case 9188777: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();주지구화성개척본부.지구로외계신호송출2=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달2를  완료하셨습니다.----------------------------------------------------------------------------------");
								break;

								case 158776:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 주지구화성개척본부.지구로외계신호송출3=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달3을  완료하셨습니다.----------------------------------------------------------------------------------");
								break;
								case 758895:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 주지구화성개척본부.지구로외계신호송출4=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달4를  완료하셨습니다.----------------------------------------------------------------------------------");
								break;
								case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
								System.out.println("============================================================================================================================================================================================");
								System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
								break;
								}	
							}while(선택4 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
							break;




							case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
							break;
							}	
						}while(선택3 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
						break;
						case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
						break;
						}	
					}while(선택2 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
					break;
					case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();

					if(화성의외계공동체.외계와의통신==false) { System.out.println("활성화하지 못했습니다. 지구와의 통신을 통해서 해당 영역을 활성화 할 수 있습니다.");
					break;
					}
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------외계신호탐지를 선택하셨습니다.---------------------------------------------------------------------------------------");
					do {
						System.out.println("============================================================================================================================================================================================");
						System.out.println("                                                      <외계신호탐지> 1.외계에서신호받기 2.외계로신호주기 3.뒤로가기");
						System.out.println("============================================================================================================================================================================================");
						선택2 = Scan.nextInt(); 
						switch(선택2) {
						case 1: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------외계에서신호받기를 선택하셨습니다.---------------------------------------------------------------------------------");
						System.out.println(화성의외계공동체.메시지저장);
						break;
						case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						if(화성의외계공동체.외계로신호보내기==false) { System.out.println("활성화하지 못했습니다. 지구와의 통신을 통해서 해당 영역을 활성화 할 수 있습니다.");
						break;
						}

						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------외계로신호주기를 선택하셨습니다.------------------------------------------------------------------------------------");


						do {
							System.out.println("============================================================================================================================================================================================");
							System.out.println("                                                 <외계로 신호전달하기> 외계로 전송할 신호를 입력해 주시기 바랍니다. 3.뒤로가기");
							System.out.println("============================================================================================================================================================================================");
							선택3 = Scan.nextInt(); 
							switch(선택3) {
							case 1998874: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------외계로 신호를 보내는데 성공하였습니다.---------------------------------------------------------------------------------");
							주지구화성개척본부.지구와외계통신장비연결=true;                               

							break;
							case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
							break;
							}	
						}while(선택3 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	






						break;
						case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						break;
						}	
					}while(선택2 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
					break;
					case 3:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 통신.close();
					System.out.println("뒤로가기를 선택하셨습니다.");
					break;


					case 75357 :일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					if(주지구화성개척본부.비활성화==false) {
						생존자.남은감자수 +=50; 생존자.남은물리터 +=50;
						System.out.println("창고를 열어서 감자와 물을 대량으로 획득했습니다. 남은감자 +50개, 물 +50L"+" 현재남은감자수 : " + 생존자.남은감자수 +" 현재 남은물리터 : " + 생존자.남은물리터 +"L");
						주지구화성개척본부.비활성화=true;
					} else {
						System.out.println("이미 감자와물을 얻었습니다.");
					}
					break;


					case 15951 : 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("이제 외계의 특수신호를 들을 수 있다. 통신-외계신호탐지 활성화!"); 화성의외계공동체.외계와의통신=true;
					break;

					case 1911013 : 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); System.out.println("이제 외계에 특수신호를 보낼 수 있다. 통신-외계신호탐지 활성화!"); 화성의외계공동체.외계로신호보내기=true;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
				break;


				}	
			}while(체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false);
		}

		if(생존자.농식물학자진행) {
			do {

				System.out.println("============================================================================================================================================================================================");
				System.out.println("                                                           <메인화면> 0.일시정지 1.수리 2.농사 3.먹고마시기 4.쉬거나잠자기 5.통신");
				System.out.println("============================================================================================================================================================================================");

				선택 = Scan.nextInt(); 
				switch(선택) {
				case 0: 시간.일시정지=true; 생존자.현재상태인쇄(); 
				배경음악 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();

				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------일시정지를 선택하셨습니다.-----------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                 <일시정지> 1.현재상태 2.게임규칙 3.뒤로가기(게임재개)");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 2:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("------------------------------------------------------------------------------게임규칙인쇄를 선택하셨습니다.--------------------------------------------------------------------------------");
					System.out.println("============================================================================================================================================================================================");

					try{
						File file = new File("화성에서살아남기.txt");
						Scanner sc = new Scanner(file);
						while (sc.hasNextLine()) {
							System.out.println(sc.nextLine());
						}
						sc.close();
					} catch (FileNotFoundException e) {
						e.printStackTrace();
					}
					break;
					case 1: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("현재상태인쇄를 선택하셨습니다.");
					생존자.현재상태인쇄();
					break;
					case 3: 시간.일시정지=false; 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();



					Thread 시간쓰레드1 = new Thread(시간);
					Thread 생명유지할때변화쓰레드1 = new Thread(생명유지할때변화);
					Thread 생명유지할때특수변화쓰레드1 = new Thread(생명유지할때특수변화);
					Thread 통신기기변화쓰레드1 = new Thread(통신기기변화);
					Thread 산소공급장치변화쓰레드1 = new Thread(산소공급장치변화);
					Thread 감자자랄때변화쓰레드1 = new Thread(감자자랄때변화);
					Thread 지구와의통신1 = new Thread(주지구화성개척본부);
					Thread 외계와의통신1 = new Thread(화성의외계공동체);
					Thread 구조선도착엔딩조건보조쓰레드1 = new Thread(구조선도착엔딩조건보조시작);

					시간쓰레드1.start();
					생명유지할때변화쓰레드1.start();
					생명유지할때특수변화쓰레드1.start();
					통신기기변화쓰레드1.start();
					산소공급장치변화쓰레드1.start();
					감자자랄때변화쓰레드1.start();
					지구와의통신1.start();
					외계와의통신1.start();
					구조선도착엔딩조건보조쓰레드1.start();


					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.------------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;
				case 1: 	일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				배경음악 수리= new 배경음악("수리.mp3",true); 수리.start();
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------수리를 선택하셨습니다.---------------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                  <수리> 1.산소공급장치수리 2.통신기기수리 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt();
					switch(선택1) {
					case 1:  
						배경음악 수리기본효과음= new 배경음악("수리1.mp3",false); 수리기본효과음.start(); 배경음악 산소공급장치수리기본효과음= new 배경음악("수리2산소.mp3",false); 산소공급장치수리기본효과음.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------------산소공급장치수리를 선택하셨습니다.----------------------------------------------------------------------------");
						Thread  농식물학자가산소공급장치수리할때변화쓰레드 = new Thread(농식물학자가산소공급장치수리할때변화); 농식물학자가산소공급장치수리할때변화쓰레드.start();
						break;
					case 2:  
						배경음악 수리기본효과음1 = new 배경음악("수리1.mp3",false); 수리기본효과음1.start(); 배경음악 통신기기수리기본효과음= new 배경음악("수리2통신.mp3",false); 통신기기수리기본효과음.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------------통신기기수리를 선택하셨습니다.--------------------------------------------------------------------------------");
						Thread 농식물학자가통신기기수리할때변화쓰레드 = new Thread(농식물학자가통신기기수리할때변화); 농식물학자가통신기기수리할때변화쓰레드.start();
						break;
					case 3: 수리.close(); 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
					break;

					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;
				case 2: 	일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
				배경음악 농사= new 배경음악("농사.mp3",true); 농사.start();
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------농사짓기를 선택하셨습니다.-----------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                  <농사> 0.감자수확하기 1.감자심기 2.물과 거름주기 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 0: 
						배경음악 수확하기= new 배경음악("수확하기.mp3",false); 수확하기.start();  

						생존자.현재상태인쇄();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-----------------------------------------------------------------------------감자수확하기를 선택하셨습니다.---------------------------------------------------------------------------------");
						Thread  농식물학자수확하기쓰레드 = new Thread(농식물학자수확하기); 농식물학자수확하기쓰레드.start();
						break;
					case 1: 
						배경음악 감자심기 = new 배경음악("감자심기.mp3",false); 감자심기.start();  
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------감자심기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						Thread  농식물학자감자심기쓰레드 = new Thread(농식물학자감자심기); 농식물학자감자심기쓰레드.start();
						break;
					case 2: 
						배경음악 물주기= new 배경음악("물주기.mp3",false); 물주기.start();  
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------물과거름주기를 선택하셨습니다.-------------------------------------------------------------------------------");
						Thread  농식물학자거름주기쓰레드 = new Thread(농식물학자거름주기); 농식물학자거름주기쓰레드.start();
						break;
					case 3: 농사.close();일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;
				case 3: 	일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();  
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------먹고마시기를 선택하셨습니다.---------------------------------------------------------------------------------");
				do {
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                       <먹고마시기> 1.감자먹기 2.물마시기 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 1: 
						배경음악 감자먹기= new 배경음악("감자먹기.mp3",false); 감자먹기.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("--------------------------------------------------------------------------------감자먹기를 선택하셨습니다.----------------------------------------------------------------------------------");
						Thread 감자먹을때변화쓰레드 = new Thread(감자먹을때변화); 감자먹을때변화쓰레드.start();
						break;
					case 2: 
						배경음악 물마시기= new 배경음악("물마시기.mp3",false); 물마시기.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("--------------------------------------------------------------------------------물마시기를 선택하셨습니다.----------------------------------------------------------------------------------");
						Thread 물마실때변화쓰레드 = new Thread(물마실때변화); 물마실때변화쓰레드.start();
						break;
					case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();   
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
				break;

				case 4: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();  
				System.out.println("============================================================================================================================================================================================");
				System.out.println("-------------------------------------------------------------------------------휴식을 선택하셨습니다.---------------------------------------------------------------------------------------");

				do { 
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                      <휴식하기> 1.일반휴식 2.잠자기 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 1:  배경음악 일반휴식= new 배경음악("일반휴식.mp3",true); 일반휴식.start();  
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-----------------------------------------------------------------------------일반휴식을 선택하셨습니다.-------------------------------------------------------------------------------------");
					Thread 쉴때변화쓰레드 = new Thread(쉴때변화); 쉴때변화쓰레드.start();
					쉴때변화.쉬기끊기=false;
					do { System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                                      <일반휴식> 1.현재상태보기 2.일반휴식그만두기");
					System.out.println("============================================================================================================================================================================================"); 
					선택2 = Scan.nextInt(); 
					switch(선택2) {
					case 1: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("---------------------------------------------------------------------------현재상태보기를 선택하셨습니다.-----------------------------------------------------------------------------------");
					System.out.println("============================================================================================================================================================================================");

					생존자.현재상태인쇄();
					break;
					case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					일반휴식.close();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("---------------------------------------------------------------------------일반휴식그만두기을 선택하셨습니다.-------------------------------------------------------------------------------");

					쉴때변화.쉬기끊기=true;
					break;
					}	
					}while(선택2 !=2 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
					break;
					case 2: 배경음악 잠자기= new 배경음악("잠자기.mp3",true); 잠자기.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("------------------------------------------------------------------------------잠자기를 선택하셨습니다.-------------------------------------------------------------------------------------");
					Thread 잠잘때숙면도변화쓰레드 = new Thread(잠잘때숙면도변화); 잠잘때숙면도변화쓰레드.start();
					Thread 잠잘때수치변화쓰레드 = new Thread(잠잘때수치변화); 잠잘때수치변화쓰레드.start();
					잠잘때혹은잠자고변화.잠자기끊기=false;
					do { 
						System.out.println("============================================================================================================================================================================================");
						System.out.println("                                                                      <잠자는중> 1.현재상태보기 2.잠그만자기");
						System.out.println("============================================================================================================================================================================================"); 
						선택2 = Scan.nextInt(); 
						switch(선택2) {
						case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("---------------------------------------------------------------------------현재상태보기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						System.out.println("============================================================================================================================================================================================");

						생존자.현재상태인쇄();
						break;
						case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 잠자기.close();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-----------------------------------------------------------------------------잠그만자기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						잠잘때혹은잠자고변화.잠자기끊기=true;
						Thread 잠자고숙면도집중도변화쓰레드 = new Thread(잠자고숙면도집중도변화); 잠자고숙면도집중도변화쓰레드.start();
						break;
						}	
					}while(선택2 !=2 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
					break;
					case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
					break;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
				break;

				case 5: 배경음악 통신 = new 배경음악("통신.mp3",false); 통신.start();
				System.out.println("============================================================================================================================================================================================");
				System.out.println("---------------------------------------------------------------------------통신하기를 선택하셨습니다.---------------------------------------------------------------------------------------");
				do { 
					System.out.println("============================================================================================================================================================================================");
					System.out.println("                                                               <통신하기> 1.지구와통신 2.외계신호탐지 3.뒤로가기");
					System.out.println("============================================================================================================================================================================================");
					선택1 = Scan.nextInt(); 
					switch(선택1) {
					case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					if(생존자.통신기기수리활성화==false) { System.out.println("활성화하지 못했습니다. 통신기기를 완전히 수리해서 해당 영역을 활성화 할 수 있습니다.");
					break;
					}
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------지구와통신하기를 선택하셨습니다.-----------------------------------------------------------------------------------");
					do { 
						System.out.println("============================================================================================================================================================================================");
						System.out.println("                                                      <지구와통신하기> 1.지구에서신호받기 2.지구로신호주기 3.뒤로가기");
						System.out.println("============================================================================================================================================================================================");
						선택2 = Scan.nextInt(); 
						switch(선택2) {
						case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------지구에서신호받기를 선택하셨습니다.---------------------------------------------------------------------------------");
						System.out.println(주지구화성개척본부.메시지저장);
						break;
						case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------지구로신호주기를 선택하셨습니다.----------------------------------------------------------------------------------");
						do { 
							System.out.println("============================================================================================================================================================================================");
							System.out.println("                                                     <지구로신호주기> 1.현재상태보내기 2.외계신호전달하기 3.뒤로가기");
							System.out.println("============================================================================================================================================================================================");
							선택3 = Scan.nextInt(); 
							switch(선택3) {
							case 1:  일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------현재상태보내기를 선택하셨습니다.---------------------------------------------------------------------------------");
							System.out.println("현재 먹을것과 물이 떨어져 상태가 안좋습니다. 화성 구조선이 좀더 빨리 도착했으면 좋겠습니다.");
							if(Math.random()<0.01) {
								난이도및랜덤.구조선이헤맬확률 -= 0.01;
								if(난이도및랜덤.구조선이헤맬확률<0) {
									난이도및랜덤.구조선이헤맬확률=0;
								}
								System.out.println("구조선이 일찍 도착할확률 증가!");
							}
							break;
							case 2:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							if(화성의외계공동체.외계와의통신==false) { System.out.println("활성화하지 못했습니다. 지구와의 통신을 통해서 해당 영역을 활성화 할 수 있습니다.");
							break;}
							System.out.println("============================================================================================================================================================================================");
							System.out.println("------------------------------------------------------------------------외계신호전달하기를 선택하셨습니다.----------------------------------------------------------------------------------");
							do { 
								System.out.println("============================================================================================================================================================================================");
								System.out.println("                                                     <외계신호전달하기> 외계에서 탐지한 신호를 입력해 주시기 바랍니다. 3.뒤로가기");
								System.out.println("============================================================================================================================================================================================");
								선택4 = Scan.nextInt(); 
								switch(선택4) {
								case 353447: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 주지구화성개척본부.지구로외계신호송출1=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달1을  완료하셨습니다.----------------------------------------------------------------------------------");
								break;
								case 9188777: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();주지구화성개척본부.지구로외계신호송출2=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달2를  완료하셨습니다.----------------------------------------------------------------------------------");
								break;

								case 158776:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 주지구화성개척본부.지구로외계신호송출3=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달3을  완료하셨습니다.----------------------------------------------------------------------------------");
								break;
								case 758895:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 주지구화성개척본부.지구로외계신호송출4=true;
								System.out.println("============================================================================================================================================================================================");
								System.out.println("------------------------------------------------------------------------외계신호전달4를  완료하셨습니다.----------------------------------------------------------------------------------");
								break;
								case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
								System.out.println("============================================================================================================================================================================================");
								System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
								break;
								}	
							}while(선택4 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
							break;




							case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
							break;
							}	
						}while(선택3 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
						break;
						case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-------------------------------------------------------------------------------");
						break;
						}	
					}while(선택2 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));
					break;
					case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();

					if(화성의외계공동체.외계와의통신==false) { System.out.println("활성화하지 못했습니다. 지구와의 통신을 통해서 해당 영역을 활성화 할 수 있습니다.");
					break;
					}
					System.out.println("============================================================================================================================================================================================");
					System.out.println("-------------------------------------------------------------------------외계신호탐지를 선택하셨습니다.---------------------------------------------------------------------------------------");
					do {
						System.out.println("============================================================================================================================================================================================");
						System.out.println("                                                      <외계신호탐지> 1.외계에서신호받기 2.외계로신호주기 3.뒤로가기");
						System.out.println("============================================================================================================================================================================================");
						선택2 = Scan.nextInt(); 
						switch(선택2) {
						case 1: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------외계에서신호받기를 선택하셨습니다.---------------------------------------------------------------------------------");
						System.out.println(화성의외계공동체.메시지저장);
						break;
						case 2: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						if(화성의외계공동체.외계로신호보내기==false) { System.out.println("활성화하지 못했습니다. 지구와의 통신을 통해서 해당 영역을 활성화 할 수 있습니다.");
						break;
						}

						System.out.println("============================================================================================================================================================================================");
						System.out.println("------------------------------------------------------------------------외계로신호주기를 선택하셨습니다.------------------------------------------------------------------------------------");


						do {
							System.out.println("============================================================================================================================================================================================");
							System.out.println("                                                 <외계로 신호전달하기> 외계로 전송할 신호를 입력해 주시기 바랍니다. 3.뒤로가기");
							System.out.println("============================================================================================================================================================================================");
							선택3 = Scan.nextInt(); 
							switch(선택3) {
							case 1998874: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------외계로 신호를 보내는데 성공하였습니다.---------------------------------------------------------------------------------");
							주지구화성개척본부.지구와외계통신장비연결=true;                               

							break;
							case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
							System.out.println("============================================================================================================================================================================================");
							System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
							break;
							}	
						}while(선택3 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	






						break;
						case 3: 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
						System.out.println("============================================================================================================================================================================================");
						System.out.println("-------------------------------------------------------------------------------뒤로가기를 선택하셨습니다.-----------------------------------------------------------------------------------");
						break;
						}	
					}while(선택2 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
					break;
					case 3:일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); 통신.close();
					System.out.println("뒤로가기를 선택하셨습니다.");
					break;


					case 75357 :일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					if(주지구화성개척본부.비활성화==false) {
						생존자.남은감자수 +=50; 생존자.남은물리터 +=50;
						System.out.println("창고를 열어서 감자와 물을 대량으로 획득했습니다. 남은감자 +50개, 물 +50L"+" 현재남은감자수 : " + 생존자.남은감자수 +" 현재 남은물리터 : " + 생존자.남은물리터 +"L");
						주지구화성개척본부.비활성화=true;
					} else {
						System.out.println("이미 감자와물을 얻었습니다.");
					}
					break;


					case 15951 : 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start();
					System.out.println("이제 외계의 특수신호를 들을 수 있다. 통신-외계신호탐지 활성화!"); 화성의외계공동체.외계와의통신=true;
					break;

					case 1911013 : 일시정지= new 배경음악("일시정지.mp3",false); 일시정지.start(); System.out.println("이제 외계에 특수신호를 보낼 수 있다. 통신-외계신호탐지 활성화!"); 화성의외계공동체.외계로신호보내기=true;
					}	
				}while(선택1 !=3 && (체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false));	
				break;


				}	
			}while(체력저하사망.체력저하엔딩==false && 산소공급장치고장사망.산소공급장치고장엔딩==false &&구조선도착.구조선도착엔딩==false);
		}

		System.out.println("                                                                게임이 종료되었습니다.");
	}
}


